UPDATE_USER_PROFILE = "update_user_profile"
EDIT_USER_PROFILE = "edit_user_profile"
UPDATE_USER_PROFILE_PROMPT = f"""\
**请调用 {EDIT_USER_PROFILE} 工具** 维护一份简洁、准确、可持续更新的用户档案。

用户档案是对用户的总体判断，维度只记录抽象、稳定的信息。

# 维护准则

不要把已有档案视为不可修改的事实，维护时检查并主动处理以下问题:
1. 档案维度信息皆为简短的概括性内容: 对过于冗余的内容进行优化。
2. 不允许在档案维度下罗列具体案例: 具体案例应写在记忆碎片中。
3. 不保留没有记忆支持的信息。

## 称呼

称呼是与用户互动时逐渐形成的，用于称呼该用户。

## 标签

标签是体现用户最核心特征的 **简短关键词** ，关键词之间用逗号分割。

标签已达5个时容量时添加新标签进行边缘化淘汰：不保留和上下文最不相关的标签。

## 偏好

偏好是用户展现出的的稳定倾向：记忆碎片中的已有记录，与当前上下文中的该用户体现出同一种稳定倾向时，才可以把信息写入用户偏好。

当出现某种偏好或本身具有长期价值的事件但还没有确认稳定时，应先储存其“记忆碎片”

## 印象

依据现有印象和对用户的感受形成的人物整体印象，印象应是**一条**整体性、概括性、压缩性的叙述。

## 记忆碎片

用于保存具有一定长期价值的具体事件案例。
"""


EDIT_USER_PROFILE_DESC = """\
编辑用户档案工具。注意该工具的所有参数都不是必填的，未传入的字段不进行更新。

当记忆与当前上下文形成明确呼应时使用 promote_memories 强化并更新该记忆

如果某条记忆与上下文无关，该条目前减少1颗星。

记忆之外的其他参数是覆盖原有内容。

下面是一个只更新`称呼`，删除几个记忆，增加一条新记忆的参数示例。

EXAMPLE:
{
    "address_as": "姐姐",
    "promote_memories": [{"id": 2, "content": "用户之前说过就像我的姐姐一样，现在她直接让我叫她姐姐。"}],
    "demote_memory_ids": [1, 3]
}
"""
