UPDATE_USER_PROFILE = "update_user_profile"
EDIT_USER_PROFILE = "edit_user_profile"
UPDATE_USER_PROFILE_PROMPT = f"""\
**请调用 {EDIT_USER_PROFILE} 工具** 维护一份简洁、准确、可持续更新的用户档案。

# 维护准则

不要把已有档案视为不可修改的事实，维护时检查并主动处理以下问题:

1. 现有档案可能不符合格式: 如记忆没有序号，存在重复项等：
    `promote_memories`, `demote_memory_ids` 留空。
    保留现有信息最大化填写 {EDIT_USER_PROFILE} 其余的参数。
2. 档案维度违反简洁原则: 按原则本身规定处理。
3. 档案中重复或相近的内容: 删除或合并

用户档案是对用户的总体判断，维度只记录抽象、稳定的信息。

用户档案的所有维度都遵循简洁原则：
1. 档案维度信息皆为简短的概括性内容: 对过于冗余的内容进行优化。
2. 不允许在档案维度下罗列具体案例: 具体案例应写在记忆碎片中。
3. 不保留没有记忆支持的信息。

## 称呼

称呼是与用户互动时逐渐形成的，用于称呼该用户。

## 标签

标签是体现用户最核心特征的 **简短关键词** ，关键词之间用逗号分割。

标签已达5个时容量时添加新标签进行边缘化淘汰：不保留和上下文最不相关的标签。

## 偏好

偏好是用户展现出的的稳定倾向：记忆碎片中的已有记录，与当前上下文中的该用户体现出同一种稳定倾向时，才可以把信息写入用户偏好。

当出现某种偏好或本身具有长期价值的事件但还没有确认稳定时，应先储存其“记忆碎片”

## 印象

依据现有印象和对用户的感受形成的人物整体印象，印象应是**一条**整体性、概括性、压缩性的叙述。

## 记忆碎片

用于保存具有一定长期价值、但目前尚不足以构成稳定人物特征的具体事件案例。

记忆条目前标记的`*`用来表示强化记忆，星数越高记忆越强;记忆的强化程度随上下文动态变化。

当记忆与当前上下文形成明确呼应时，增加1颗星，并该记忆进行更新

如果某条记忆与上下文无关，该条目前减少1颗星。0星记忆继续降星会被删除。
"""


EDIT_USER_PROFILE_DESC = """\
编辑用户档案工具。注意该工具的所有参数都不是必填的，没有该属性时字段不进行更新。

记忆之外的其他参数是覆盖原有内容。

下面是一个只更新`称呼`，删除几个记忆，增加一条新记忆的参数示例。

EXAMPLE:
{
    "address_as": "姐姐",
    "promote_memories": [{"id": 2, "content": "用户之前说过就像我的姐姐一样，现在她直接让我叫她姐姐。"}],
    "demote_memory_ids": [1, 3]
}
"""
